[
    {
        "id": "2188381",
        "date": "10/Nov/2025",
        "title": "LOK SABHA SPEAKER URGES ALL POLITICAL PARTIES TO UPHOLD THE DIGNITY OF LEGISLATIVE INSTITU",
        "ministry": "Lok Sabha Secretariat",
        "url": "https://pib.gov.in/PressReleaseIframePage.aspx?PRID=2188381",
        "article": "Lok Sabha Secretariat LOK SABHA SPEAKER URGES ALL POLITICAL PARTIES TO UPHOLD THE DIGNITY OF LEGISLATIVE INSTITUTIONS AND ENSURE ORDERLY CONDUCT OF PROCEEDINGS; SAYS PLANNED DISRUPTIONS WEAKEN DEMOCRACY LEGISLATURES MUST TURN PUBLIC OPINION INTO POLICY: LOK SABHA SPEAKER DEVELOPMENT STRATEGIES FOR THE NORTHEAST SHOULD INTEGRATE CLIMATE RESILIENCE, GREEN INFRASTRUCTURE, AND ACTIVE COMMUNITY PARTICIPATION: LOK SABHA SPEAKER REMARKABLE DIGITAL TRANSFORMATION TAKING PLACE ACROSS THE LEGISLATURES OF THE NORTHEAST, ARTIFICIAL INTELLIGENCE MUST BE USED RESPONSIBLY AND ETHICALLY: LOK SABHA SPEAKER STRONGER CENTRE–STATE COOPERATION CRITICAL TO DELIVER EFFECTIVE GOVERNANCE AND SUCCESSFUL POLICY OUTCOMES: LOK SABHA SPEAKER LOK SABHA SPEAKER INAUGURATES 22ND CPA CONFERENCE IN KOHIMA; SAYS ALL NORTHEASTERN STATES, INCLUDING NAGALAND, ARE PARTNERS IN THE VISION OF A SELF-RELIANT INDIA: LOK SABHA SPEAKER Posted On:\n                10 NOV 2025 4:51PM by PIB Delhi Lok Sabha Speaker Shri Om Birla today made a strong appeal to all political parties to uphold the dignity of legislative institutions by ensuring their smooth and orderly functioning. The Speaker emphasized that democracy provides ample avenues to raise issues, express concerns, and engage in debate through peaceful, structured, and informed discussions. Speaking to media persons on the sidelines of the Annual Conference of the Commonwealth Parliamentary Association (CPA), India Region, Zone–III being held at the Nagaland Legislative Assembly in Kohima, he cautioned that planned disruptions not only undermine democratic processes but also deprive citizens of meaningful deliberations and accountability. Referring to the upcoming Winter Session of Parliament, scheduled to commence on 1 December 2025, the Speaker urged all political parties to ensure the smooth conduct of House proceedings. He further stressed that the legislatures must play a more active and constructive role for transparent governance and welfare-oriented policymaking. Earlier, while inaugurating the Commonwealth Parliamentary Association (CPA) India Region, Zone–III Conference, the Speaker underlined that legislatures must play a pivotal role in transforming public opinion into policy. Shri Om Birla observed that the responsibility of legislatures extends beyond law-making—it is to translate the aspirations and concerns of the people into actionable policies. He emphasized that comprehensive development is possible only through active public participation, noting that true progress occurs when citizens are directly involved in the democratic process. Public representatives, he said, must therefore ensure that citizens’ voices are meaningfully reflected in policymaking. नागालैंड विधानसभा में 22वें वार्षिक Commonwealth Parliamentary Association (CPA), India Region, Zone–III सम्मेलन के उद्घाटन सत्र को संबोधित किया। नागालैंड समृद्ध संस्कृति, प्रकृति, परम्पराओं, सुंदरता और वीरों की धरती रही है; जिसने लोकतांत्रिक संवाद को बढ़ावा देने में महत्वपूर्ण… pic.twitter.com/meu0sW1XvG — Om Birla (@ombirlakota) November 10, 2025 Theme of this year’s conference is “Policy, Progress, and Citizens: Legislature as Catalysts of Change”. Shri Birla expressed hope that meaningful deliberations during the conference would lead to concrete action plans aimed at making Northeastern legislatures more empowered, accountable, and efficient. In his address, the Speaker highlighted the impact of new technologies and innovations in bringing citizens closer to democracy, pointing out that most legislatures have now transitioned to paperless and digital systems. He reiterated that the foundation of Indian democracy lies in its people, a principle deeply cherished by the framers of the Constitution, and stressed that transparency and accountability must remain central to democratic governance. Shri Birla further urged all legislative bodies to adopt measures such as live telecast of proceedings, citizen-friendly digital platforms, and enhanced outreach mechanisms to foster broader public engagement in the legislative process. “When public opinion forms the basis of policy in any state, that state achieves continuous and sustainable development,” he added. नागालैंड और हमारे उत्तर-पूर्वी राज्य प्राकृतिक एवं पारिस्थितिक दृष्टि से समृद्ध हैं। जब ये प्रदेश स्वावलंबी होंगे, तब निश्चय ही हमारा देश आत्मनिर्भर और विकसित होगा। आज इस अवसर पर विधानसभा परिसर में मनोहारी प्रादेशिक प्रदर्शनी का अवलोकन किया, तथा समस्त प्रांत वासियों को आगामी… pic.twitter.com/N5rHLryTGt — Om Birla (@ombirlakota) November 10, 2025 The Speaker commended the remarkable digital transformation taking place across the legislatures of the Northeast, noting it as a significant step toward modern and transparent governance. He particularly praised the Nagaland Legislative Assembly for becoming a fully paperless legislature, describing it as a pioneering model of digital governance in India. Shri Birla observed that such digital initiatives not only enhance efficiency and transparency but also make legislative functioning more accessible and citizen-centric. At the same time, he cautioned against the irresponsible use of emerging technologies, particularly Artificial Intelligence (AI), and urged legislators to adopt AI in ways that promote transparency, strengthen democratic processes, and safeguard the integrity of legislative proceedings. नागालैंड में आज से आरम्भ हो रहे 22वें वार्षिक CPA, India Region, Zone–III सम्मेलन में शामिल होने के लिए विधानसभा भवन पहुँचने पर नागालैंड के मुख्यमंत्री श्री नेफ्यू रियो जी, नागालैंड विधानसभा के अध्यक्ष श्री शारिंगैन लोंगकुमेर जी तथा अन्य गणमान्यों द्वारा किए गए स्वागत से अभिभूत… pic.twitter.com/esyqN3Zsql — Om Birla (@ombirlakota) November 10, 2025 On Centre–State relations, the Speaker observed that while each level of government functions within clearly defined constitutional frameworks, effective collaboration between the two is vital for achieving tangible outcomes. He emphasized that constructive dialogue between the Centre and the States not only strengthens governance but also leads to policies that are more responsive, inclusive, and attuned to regional priorities. Shri Birla further noted that enhanced cooperation in recent years has already led to significant progress in infrastructure, connectivity, and public service delivery across the Northeastern region. Emphasising the need for a comprehensive action plan for the holistic development of the Northeastern states, Shri Om Birla highlighted the importance of factoring in the region’s unique geographical conditions and climate-related challenges. He underscored that such a plan must specifically address emerging climate risks, including natural disasters, which have a profound impact on the region’s livelihoods and infrastructure. Stressing the importance of sustainable and inclusive growth, the Speaker stated that development strategies for the Northeast should integrate climate resilience, green infrastructure, and active community participation to ensure long-term progress. He further noted that collaborative efforts among the Centre, state governments, and local communities are essential to harness the region’s immense potential while preserving its rich biodiversity and cultural heritage. Shri Om Birla observed that it is a matter of pride that all legislatures of the Northeastern region are upholding the tradition of collective deliberation and decision-making while being deeply attuned to local needs and aspirations. He noted that these legislatures are consistently working to strengthen accountability and transparency in governance, reflecting the true spirit of participatory democracy. The Lok Sabha Speaker further remarked that the Northeastern states are witnessing rapid progress in infrastructure development, particularly in road, rail, and air connectivity. In line with the vision of Prime Minister Shri Narendra Modi, he said, concrete efforts are being made to establish the Northeast as a hub of growth and pivot to India’s Act East policy. Highlighting the region’s immense potential for growth, Shri Birla noted that its vibrant culture, rich traditions, and natural beauty make it truly unique. He emphasized that promoting local products, arts, culture, and traditional crafts can play a pivotal role in advancing the goal of a self-reliant India (Atmanirbhar Bharat). The Speaker urged that legislatures adopt policies that foster industry and entrepreneurship, thereby creating greater opportunities for local communities and enabling broad-based economic empowerment. Shri Om Birla expressed confidence that the two-day CPA India Region, Zone–III Conference would yield substantive recommendations to strengthen democratic institutions across the region, refine legislative practices, and enhance public trust in governance. He extended his warm greetings to all delegates ahead of the upcoming Hornbill Festival, describing it as a global celebration of Nagaland’s culture, resilience, artistry, and community spirit. Commending Nagaland’s exceptional hospitality, the Speaker noted that such events foster closer bonds among Northeastern legislatures, providing a valuable platform for collective reflection on regional aspirations and developmental priorities. He also conveyed his best wishes to the people of Nagaland for the forthcoming Hornbill Festival in December, calling it a symbol of the region’s rich cultural heritage and vibrant folk traditions. During the event, Chief Minister, Nagaland, Shri Neiphiu Rio; Rajya Sabha Deputy Chairman, Shri Harivansh, Speaker, Speaker, Nagaland Legislative Assembly, Shri Sharingain Longkümer, and Minister for Parliamentary Affairs, Government of Nagaland, Shri K.G. Kenye also addressed the gathering. The legislatures of the eight Northeastern states of India are members of CPA Zone 3. In this conference, legislatures from 7 out of the 8 member states of this zone participated. A total of 12 presiding officers attended the conference, including 7 Speakers and 5 Deputy Speakers. Members of Parliament from this region and Members of the Legislative Assemblies also took part in the conference. The theme of the Conference is “Policy, Progress & People: Legislatures as Catalysts of Change.”  The sub-themes are: (i) Role of Legislatures in Achieving Viksit Bharat @ 2047; and (ii) Climate Change – In the Light of Recent Cloudbursts and Landslides in Parts of the Northeast Region. *** AM (Release ID: 2188381) Read this release in: Urdu , Gujarati"
    }
]